CCP-WSI-OpenFOAM-workshop/Day 2/2 - Parallel Programming in OpenFOAM/Related Material/pstreamTest/testcase/Allrun
#!/bin/bash

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh 
runApplication decomposePar

runParallel `getApplication`
#rm -r processor* 2>/dev/null
